src/stage-1-prototype/InformationRegisters/Расш1_НастройкиОбменаБ24.xml
<?xml version='1.0' encoding='UTF-8'?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_НастройкиОбменаБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Секрет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_СвязиЗаказовБ24.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_СвязиЗаказовБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЗадачаId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
<Resource>
	<Properties>
		<Name>Портал</Name>
		<Type>
			<v8:Type>xs:string</v8:Type>
			<v8:StringQualifiers>
				<v8:Length>255</v8:Length>
			</v8:StringQualifiers>
		</Type>
	</Properties>
</Resource>

<Resource>
	<Properties>
		<Name>Ссылка</Name>
		<Type>
			<v8:Type>xs:string</v8:Type>
			<v8:StringQualifiers>
				<v8:Length>0</v8:Length>
			</v8:StringQualifiers>
		</Type>
	</Properties>
</Resource>

<Resource>
	<Properties>
		<Name>Название</Name>
		<Type>
			<v8:Type>xs:string</v8:Type>
			<v8:StringQualifiers>
				<v8:Length>0</v8:Length>
			</v8:StringQualifiers>
		</Type>
	</Properties>
</Resource>

		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/InformationRegisters/Расш1_ОперацииБ24.xml
<?xml version='1.0' encoding='UTF-8'?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>Расш1_ОперацииБ24</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ОперацияId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнициаторId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РабочееМестоId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СеансId</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СнимокJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Опубликована</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ошибка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказКлиента</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/stage-1-prototype/CommonModules/Расш1_ОбменБ24Сервер/Ext/Module.bsl
// Демопрототип. Настройки и секреты задаются в данных базы, не в исходниках CFE.
Функция СостояниеПрототипа() Экспорт
    Возврат Новый Структура("РегистрОпераций,РегистрНастроек,Включен",
        "Расш1_ОперацииБ24", "Расш1_НастройкиОбменаБ24", Настройка("enabled").Значение = "true");
КонецФункции

Функция Настройка(Ключ)
    Запрос = Новый Запрос("ВЫБРАТЬ Значение, Секрет ИЗ РегистрСведений.Расш1_НастройкиОбменаБ24 ГДЕ Ключ = &Ключ");
    Запрос.УстановитьПараметр("Ключ", Ключ);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Новый Структура("Значение,Секрет", Выборка.Значение, Выборка.Секрет);
    КонецЕсли;
    Возврат Новый Структура("Значение,Секрет", "", "");
КонецФункции

Процедура ЗаписатьНастройку(Ключ, Значение, Секрет = "")
    Запись = РегистрыСведений.Расш1_НастройкиОбменаБ24.СоздатьМенеджерЗаписи();
    Запись.Ключ = Ключ;
    Запись.Значение = Значение;
    Запись.Секрет = Секрет;
    Запись.Записать();
КонецПроцедуры

Функция БазаId()
    НачатьТранзакцию();
    Попытка
        Заблокировать("РегистрСведений.Расш1_НастройкиОбменаБ24");
        Значение = Настройка("baseId").Значение;
        Если ПустаяСтрока(Значение) Тогда
            Значение = Строка(Новый УникальныйИдентификатор);
            ЗаписатьНастройку("baseId", Значение);
        КонецЕсли;
        ЗафиксироватьТранзакцию();
        Возврат Значение;
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецФункции

Функция JSONСтрока(Значение)
    Запись = Новый ЗаписьJSON;
    Запись.УстановитьСтроку();
    ЗаписатьJSON(Запись, Значение);
    Возврат Запись.Закрыть();
КонецФункции

Функция JSONЗначение(СтрокаJSON)
    Чтение = Новый ЧтениеJSON;
    Чтение.УстановитьСтроку(СтрокаJSON);
    Значение = ПрочитатьJSON(Чтение);
    Чтение.Закрыть();
    Возврат Значение;
КонецФункции

Функция ПараметрыОбмена(Компьютер)
    Если Настройка("enabled").Значение <> "true" Тогда
        Возврат Неопределено;
    КонецЕсли;
    ПользовательId = Строка(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
    Привязка = Настройка("profile|" + ПользовательId + "|" + Компьютер);
    Сервис = Настройка("service");
    Если ПустаяСтрока(Привязка.Значение) Или ПустаяСтрока(Сервис.Значение) Или СтрДлина(Сервис.Секрет) < 32 Тогда
        Возврат Неопределено;
    КонецЕсли;
    Настройки = JSONЗначение(Сервис.Значение);
    Настройки.Вставить("clientToken", Сервис.Секрет);
    Профиль = JSONЗначение(Привязка.Значение);
    Настройки.Вставить("initiatorId", Профиль.initiatorId);
    Настройки.Вставить("workplaceId", Профиль.workplaceId);
    Настройки.Вставить("baseId", БазаId());
    // Прототип слушает локальный HTTP; сетевой listener службы требует TLS.
    Если Настройки.host <> "127.0.0.1" Или Настройки.port < 1 Или Настройки.port > 65535 Тогда
        ВызватьИсключение "STAGE1_INVALID_LOCAL_ENDPOINT";
    КонецЕсли;
    Если Лев(Настройки.portal, 8) <> "https://" Или СтрНайти(Настройки.portal, "?") > 0
        Или СтрНайти(Настройки.portal, "#") > 0 Тогда
        ВызватьИсключение "STAGE1_INVALID_PORTAL";
    КонецЕсли;
    Возврат Настройки;
КонецФункции

Процедура Заблокировать(ИмяРегистра)
    Блокировка = Новый БлокировкаДанных;
    Элемент = Блокировка.Добавить(ИмяРегистра);
    Элемент.Режим = РежимБлокировкиДанных.Исключительный;
    Блокировка.Заблокировать();
КонецПроцедуры

Функция СнимокЗаказа(Заказ)
    Если Не ПравоДоступа("Изменение", Метаданные.Документы.ЗаказКлиента) Тогда
        Возврат Неопределено;
    КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ РАЗРЕШЕННЫЕ Проведен, ПометкаУдаления,
        |ПРЕДСТАВЛЕНИЕ(Контрагент) КАК Контрагент, Номер, Дата, СуммаДокумента,
        |ПРЕДСТАВЛЕНИЕ(Валюта) КАК Валюта ИЗ Документ.ЗаказКлиента ГДЕ Ссылка = &Заказ");
    Запрос.УстановитьПараметр("Заказ", Заказ);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Не Выборка.Следующий() Или Не Выборка.Проведен Или Выборка.ПометкаУдаления Тогда
        Возврат Неопределено;
    КонецЕсли;
    Связь = РегистрыСведений.Расш1_СвязиЗаказовБ24.СоздатьМенеджерЗаписи();
    Связь.Заказ = Заказ;
    Связь.Прочитать();
    Если Связь.Выбран() Тогда Возврат Неопределено; КонецЕсли;
    Описание = "Заказ клиента №" + Выборка.Номер + " от " + Формат(Выборка.Дата, "ДФ=dd.MM.yyyy")
        + Символы.ПС + "Сумма: " + Строка(Выборка.СуммаДокумента) + " " + Выборка.Валюта
        + Символы.ПС + ПолучитьНавигационнуюСсылку(Заказ);
    Возврат Новый Структура("TITLE,DESCRIPTION,GROUP_ID", Выборка.Контрагент + ".", Описание, 36);
КонецФункции

Функция ПоставитьВОчередь(Заказ, Компьютер, СеансId) Экспорт
    Настройки = ПараметрыОбмена(Компьютер);
    Если Настройки = Неопределено Тогда Возврат "disabled"; КонецЕсли;
    НачатьТранзакцию();
    Попытка
        Заблокировать("РегистрСведений.Расш1_СвязиЗаказовБ24");
        Заблокировать("РегистрСведений.Расш1_ОперацииБ24");
        Снимок = СнимокЗаказа(Заказ);
        Если Снимок = Неопределено Тогда
            ЗафиксироватьТранзакцию();
            Возврат "ineligible";
        КонецЕсли;
        Запись = РегистрыСведений.Расш1_ОперацииБ24.СоздатьМенеджерЗаписи();
        Запись.Заказ = Заказ;
        Запись.Прочитать();
        Если Не Запись.Выбран() Тогда
            // Прочитать() сбрасывает поля менеджера, если строки ещё нет.
            Запись.Заказ = Заказ;
            Запись.ОперацияId = Строка(Новый УникальныйИдентификатор);
            Запись.Состояние = "queued";
            Запись.ИнициаторId = Настройки.initiatorId;
            Запись.РабочееМестоId = Настройки.workplaceId;
            Запись.СеансId = СеансId;
            Запись.СнимокJSON = JSONСтрока(Снимок);
            Запись.Опубликована = "false";
            Запись.Записать();
        КонецЕсли;
        ОперацияId = Запись.ОперацияId;
        ЗафиксироватьТранзакцию();
        Возврат ОперацияId;
    Исключение
        ОтменитьТранзакцию();
        ВызватьИсключение;
    КонецПопытки;
КонецФункции

Функция HTTPОбмен(Настройки, Метод, Путь, Данные = Неопределено)
    Соединение = Новый HTTPСоединение(Настройки.host, Настройки.port,,,, 2);
    Запрос = Новый HTTPЗапрос(Путь);
    Запрос.Заголовки.Вставить("Authorization", "Bearer " + Настройки.clientToken);
    Запрос.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
    Если Метод = "POST" Тогда
        Запрос.УстановитьТелоИзСтроки(JSONСтрока(Данные), КодировкаТекста.UTF8);
        Ответ = Соединение.ОтправитьДляОбработки(Запрос);
    Иначе
        Ответ = Соединение.Получить(Запрос);
    КонецЕсли;
    Если Ответ.КодСостояния <> 200 Тогда ВызватьИсключение "STAGE1_HTTP_REJECTED"; КонецЕсли;
    Возврат JSONЗначение(Ответ.ПолучитьТелоКакСтроку());
КонецФункции

Функция Опрос(Компьютер, СеансId, ОтправитьHeartbeat) Экспорт
    Настройки = ПараметрыОбмена(Компьютер);
    Если Настройки = Неопределено Тогда Возврат Ложь; КонецЕсли;
    Контекст = Новый Структура("baseId,initiatorId,workplaceId,sessionId",
        Настройки.baseId, Настройки.initiatorId, Настройки.workplaceId, СеансId);
    Если ОтправитьHeartbeat Тогда HTTPОбмен(Настройки, "POST", "/v1/1c/heartbeat", Контекст); КонецЕсли;
    Запрос = Новый Запрос("ВЫБРАТЬ Заказ, ОперацияId, СнимокJSON ИЗ РегистрСведений.Расш1_ОперацииБ24
        |ГДЕ ИнициаторId = &Инициатор И РабочееМестоId = &Место И Опубликована <> &Опубликована");
    Запрос.УстановитьПараметр("Инициатор", Настройки.initiatorId);
    Запрос.УстановитьПараметр("Место", Настройки.workplaceId);
    Запрос.УстановитьПараметр("Опубликована", "true");
    Выборка = Запрос.Выполнить().Выбрать();
    Пока Выборка.Следующий() Цикл
        Данные = Новый Структура("baseId,orderId,operationId,initiatorId,workplaceId,sessionId,payload",
            Настройки.baseId, Строка(Выборка.Заказ.УникальныйИдентификатор()), Выборка.ОперацияId,
            Настройки.initiatorId, Настройки.workplaceId, СеансId, JSONЗначение(Выборка.СнимокJSON));
        HTTPОбмен(Настройки, "POST", "/v1/task-requests", Данные);
        Запись = РегистрыСведений.Расш1_ОперацииБ24.СоздатьМенеджерЗаписи();
        Запись.Заказ = Выборка.Заказ; Запись.Прочитать();
        Запись.Опубликована = "true"; Запись.СеансId = СеансId; Запись.Записать();
    КонецЦикла;
    Проверки = HTTPОбмен(Настройки, "POST", "/v1/1c/checks", Контекст);
    Для Каждого Проверка Из Проверки.checks Цикл
        Заказ = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(Проверка.orderId));
        НачатьТранзакцию();
        Попытка
            Заблокировать("РегистрСведений.Расш1_СвязиЗаказовБ24");
            Заблокировать("РегистрСведений.Расш1_ОперацииБ24");
            Запись = РегистрыСведений.Расш1_ОперацииБ24.СоздатьМенеджерЗаписи();
            Запись.Заказ = Заказ; Запись.Прочитать();
            Снимок = Неопределено;
            Если Запись.Выбран() И Запись.ОперацияId = Проверка.operationId
                И Запись.ИнициаторId = Настройки.initiatorId И Запись.РабочееМестоId = Настройки.workplaceId Тогда
                Снимок = СнимокЗаказа(Заказ);
            КонецЕсли;
            ЗафиксироватьТранзакцию();
        Исключение
            ОтменитьТранзакцию(); ВызватьИсключение;
        КонецПопытки;
        Данные = Новый Структура("baseId,orderId,operationId,initiatorId,workplaceId,sessionId,checkId,eligible,payload",
            Настройки.baseId, Проверка.orderId, Проверка.operationId, Настройки.initiatorId,
            Настройки.workplaceId, СеансId, Проверка.checkId, Снимок <> Неопределено,
            ?(Снимок = Неопределено, Новый Структура, Снимок));
        HTTPОбмен(Настройки, "POST", "/v1/1c/validate", Данные);
    КонецЦикла;
    Результаты = HTTPОбмен(Настройки, "GET", "/v1/results");
    ИзмененаСвязь = Ложь;
    Для Каждого Результат Из Результаты.results Цикл
        Если ПринятьРезультат(Настройки, Результат) Тогда
            ИзмененаСвязь = Истина;
            Подтверждение = Новый Структура("baseId,orderId,operationId,taskId",
                Настройки.baseId, Результат.orderId, Результат.operationId, Результат.taskId);
            Попытка
                HTTPОбмен(Настройки, "POST", "/v1/acknowledgments", Подтверждение);
                СохранитьСостояние(Документы.ЗаказКлиента.ПолучитьСсылку(
                    Новый УникальныйИдентификатор(Результат.orderId)), Результат.operationId, "acknowledged", "");
            Исключение
                СохранитьСостояние(Документы.ЗаказКлиента.ПолучитьСсылку(
                    Новый УникальныйИдентификатор(Результат.orderId)), Результат.operationId, "", "ack_pending");
            КонецПопытки;
        КонецЕсли;
    КонецЦикла;
    Возврат ИзмененаСвязь;
КонецФункции

Функция ПринятьРезультат(Настройки, Результат)
    Заказ = Документы.ЗаказКлиента.ПолучитьСсылку(Новый УникальныйИдентификатор(Результат.orderId));
    НачатьТранзакцию();
    Попытка
        Заблокировать("РегистрСведений.Расш1_СвязиЗаказовБ24");
        Заблокировать("РегистрСведений.Расш1_ОперацииБ24");
        Операция = РегистрыСведений.Расш1_ОперацииБ24.СоздатьМенеджерЗаписи();
        Операция.Заказ = Заказ; Операция.Прочитать();
        Если Не Операция.Выбран() Или Операция.ОперацияId <> Результат.operationId
            Или Операция.ИнициаторId <> Настройки.initiatorId Или Операция.РабочееМестоId <> Настройки.workplaceId Тогда
            ЗафиксироватьТранзакцию(); Возврат Ложь;
        КонецЕсли;
        Если ТипЗнч(Результат.taskId) <> Тип("Число") Или Результат.taskId <= 0
            Или Результат.taskId <> Цел(Результат.taskId) Тогда ВызватьИсключение "STAGE1_INVALID_TASK_ID"; КонецЕсли;
        Связь = РегистрыСведений.Расш1_СвязиЗаказовБ24.СоздатьМенеджерЗаписи();
        Связь.Заказ = Заказ; Связь.Прочитать();
        ЗадачаId = Формат(Результат.taskId, "ЧГ=0;ЧДЦ=0");
        Если Связь.Выбран() И (Связь.ЗадачаId <> ЗадачаId Или Связь.ОперацияId <> Результат.operationId) Тогда
            Операция.Ошибка = "link_conflict"; Операция.Записать();
            ЗафиксироватьТранзакцию(); Возврат Ложь;
        КонецЕсли;
        Связь.Заказ = Заказ;
        Связь.ЗадачаId = ЗадачаId; Связь.ОперацияId = Результат.operationId; Связь.Записать();
        Операция.Состояние = "created"; Операция.Ошибка = ""; Операция.Записать();
        ЗафиксироватьТранзакцию();
        Возврат Истина;
    Исключение
        ОтменитьТранзакцию();
        // Поздний конфликт не заменяет связь и не подтверждается службе.
        СохранитьСостояние(Заказ, Результат.operationId, "", "link_save_failed");
        Возврат Ложь;
    КонецПопытки;
КонецФункции

Функция ОбновитьСостояния(Компьютер, Курсор = "", Заказ = Неопределено) Экспорт
    Настройки = ПараметрыОбмена(Компьютер);
    Если Настройки = Неопределено Тогда Возврат ""; КонецЕсли;
    // Состояния доставки читаются отдельно от результатов создания.
    // Сбой чтения сохраняет последнее состояние, а не объявляет отсутствие задачи.
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Заказ, ОперацияId ИЗ РегистрСведений.Расш1_ОперацииБ24
        |ГДЕ ИнициаторId = &Инициатор И РабочееМестоId = &Место И Опубликована = &Опубликована
        |И ((&ПоЗаказу И Заказ = &Заказ)
        |ИЛИ (НЕ &ПоЗаказу И Состояние <> &Завершено И Состояние <> &Отменено И ОперацияId > &Курсор))
        |УПОРЯДОЧИТЬ ПО ОперацияId");
    Запрос.УстановитьПараметр("Инициатор", Настройки.initiatorId);
    Запрос.УстановитьПараметр("Место", Настройки.workplaceId);
    Запрос.УстановитьПараметр("Опубликована", "true");
    Запрос.УстановитьПараметр("Завершено", "acknowledged");
    Запрос.УстановитьПараметр("Отменено", "cancelled");
    Запрос.УстановитьПараметр("Курсор", Курсор);
    Запрос.УстановитьПараметр("ПоЗаказу", ЗначениеЗаполнено(Заказ));
    Запрос.УстановитьПараметр("Заказ", ?(ЗначениеЗаполнено(Заказ), Заказ, Документы.ЗаказКлиента.ПустаяСсылка()));
    Выборка = Запрос.Выполнить().Выбрать();
    СледующийКурсор = "";
    Пока Выборка.Следующий() Цикл
        СледующийКурсор = Выборка.ОперацияId;
        Попытка
            Состояние = HTTPОбмен(Настройки, "GET", "/v1/operations/" + Выборка.ОперацияId);
            Доставка = HTTPОбмен(Настройки, "GET", "/v1/task-requests/" + Выборка.ОперацияId);
            Если Состояние.baseId <> Настройки.baseId
                Или Состояние.orderId <> Строка(Выборка.Заказ.УникальныйИдентификатор())
                Или Состояние.operationId <> Выборка.ОперацияId
                Или Доставка.operationId <> Выборка.ОперацияId
                Или Доставка.initiatorId <> Настройки.initiatorId
                Или Доставка.workplaceId <> Настройки.workplaceId Тогда
                ВызватьИсключение "STAGE1_STATUS_CONTEXT_MISMATCH";
            КонецЕсли;
            КодОшибки = "";
            Если Состояние.conflict <> Неопределено Тогда КодОшибки = Состояние.conflict; КонецЕсли;
            КодСостояния = Доставка.deliveryState;
            Если Состояние.state <> "pending" Тогда КодСостояния = Состояние.state; КонецЕсли;
            СохранитьСостояние(Выборка.Заказ, Выборка.ОперацияId, КодСостояния, КодОшибки);
        Исключение
            СохранитьСостояние(Выборка.Заказ, Выборка.ОперацияId, "", "status_unavailable");
        КонецПопытки;
    КонецЦикла;
    Возврат СледующийКурсор;
КонецФункции

Процедура СохранитьСостояние(Заказ, ОперацияId, Состояние, Ошибка)
    НачатьТранзакцию();
    Попытка
        Заблокировать("РегистрСведений.Расш1_ОперацииБ24");
        Операция = РегистрыСведений.Расш1_ОперацииБ24.СоздатьМенеджерЗаписи();
        Операция.Заказ = Заказ; Операция.Прочитать();
        Если Операция.Выбран() И Операция.ОперацияId = ОперацияId Тогда
            // Успешное чтение доставки не устраняет локальную ошибку записи/ACK.
            // Эти ошибки очищает только фиксация связи или её подтверждение.
            Если (ПустаяСтрока(Ошибка) Или Ошибка = "status_unavailable") И Состояние <> "acknowledged"
                И (Операция.Ошибка = "link_save_failed" Или Операция.Ошибка = "link_conflict"
                    Или Операция.Ошибка = "ack_pending") Тогда
                Ошибка = Операция.Ошибка;
            КонецЕсли;
            Изменено = Операция.Ошибка <> Ошибка;
            // Успешное локальное подтверждение не откатывается запоздалым ответом.
            Если Не ПустаяСтрока(Состояние) И Операция.Состояние <> "acknowledged" Тогда
                Изменено = Изменено Или Операция.Состояние <> Состояние;
                Операция.Состояние = Состояние;
            КонецЕсли;
            Если Изменено Тогда
                Операция.Ошибка = Ошибка; Операция.Записать();
            КонецЕсли;
        КонецЕсли;
        ЗафиксироватьТранзакцию();
    Исключение
        ОтменитьТранзакцию(); ВызватьИсключение;
    КонецПопытки;
КонецПроцедуры

Функция ТекстСостояния(Состояние)
    Если Состояние = "queued" Тогда Возврат "Запрос ожидает открытия карточки Б24.";
    ИначеЕсли Состояние = "claimed" Тогда Возврат "Проверяем заказ перед открытием карточки Б24.";
    ИначеЕсли Состояние = "opening" Тогда Возврат "Открываем карточку Б24. Создание задачи ещё не подтверждено.";
    ИначеЕсли Состояние = "opened" Тогда Возврат "Карточка Б24 открыта. Ожидаем результат сохранения.";
    ИначеЕсли Состояние = "created" Или Состояние = "acknowledged" Тогда
        Возврат "Задача создана. Ожидаем сохранения связи в 1С.";
    ИначеЕсли Состояние = "cancelled" Тогда Возврат "Создание задачи отменено. Связи нет.";
    КонецЕсли;
    Возврат "Проверяем, создана ли задача. Повторное создание временно заблокировано.";
КонецФункции

Функция ТекстОшибки(Код)
    Если ПустаяСтрока(Код) Тогда Возврат ""; КонецЕсли;
    Если Код = "duplicate_task_tag" Тогда Возврат "Найдено несколько задач с меткой операции. Требуется проверка связи.";
    ИначеЕсли Код = "tag_or_link_conflict" Или Код = "link_conflict" Тогда
        Возврат "Конфликт связи заказа и задачи. Сохранённая связь не заменена.";
    ИначеЕсли Код = "link_save_failed" Тогда
        Возврат "Задача создана, но связь не сохранена. Восстанавливаем прежнюю операцию; не создавайте новую задачу.";
    ИначеЕсли Код = "ack_pending" Тогда
        Возврат "Связь сохранена в 1С. Ожидаем подтверждения сервису; повторная задача не требуется.";
    ИначеЕсли Код = "task_access_denied" Тогда
        Возврат "Нет доступа к задаче Б24. Сохранённая связь не удалена.";
    ИначеЕсли Код = "invalid_settings" Тогда
        Возврат "Не удалось сформировать ссылку. Проверьте настройки портала и привязку сотрудника.";
    ИначеЕсли Код = "status_unavailable" Или Код = "service_unavailable" Тогда
        Возврат "Нет актуального ответа сервиса обмена. Показано последнее сохранённое состояние; проверка будет повторена.";
    ИначеЕсли Код = "status_read_failed" Тогда Возврат "Не удалось прочитать состояние Б24 в 1С. Обновите блок после устранения ошибки доступа.";
    КонецЕсли;
    // Произвольные ошибки, тела ответов и секреты не выводятся в форму.
    Возврат "Ошибка обмена Б24. Требуется проверка прежней операции; повторное создание заблокировано.";
КонецФункции

Функция ПоложительныйId(Значение)
    Если ТипЗнч(Значение) <> Тип("Строка") Или ПустаяСтрока(Значение) Тогда Возврат Ложь; КонецЕсли;
    Для Номер = 1 По СтрДлина(Значение) Цикл
        Если СтрНайти("0123456789", Сред(Значение, Номер, 1)) = 0 Тогда Возврат Ложь; КонецЕсли;
    КонецЦикла;
    Возврат СтрЗаменить(Значение, "0", "") <> "";
КонецФункции

Функция СсылкаЗадачи(ЗадачаId, ПользовательId)
    Если Не ПоложительныйId(ЗадачаId) Или Не ПоложительныйId(ПользовательId) Тогда Возврат ""; КонецЕсли;
    Параметры = JSONЗначение(Настройка("service").Значение);
    Портал = Параметры.portal;
    Если ТипЗнч(Портал) <> Тип("Строка") Или Лев(Портал, 8) <> "https://" Тогда Возврат ""; КонецЕсли;
    Хост = Сред(Портал, 9);
    Если Прав(Хост, 1) = "/" Тогда Хост = Лев(Хост, СтрДлина(Хост) - 1); КонецЕсли;
    Если ПустаяСтрока(Хост) Или СтрНайти(Хост, ".") = 0 Тогда Возврат ""; КонецЕсли;
    Для Номер = 1 По СтрДлина(Хост) Цикл
        Если СтрНайти("abcdefghijklmnopqrstuvwxyz0123456789.-", НРег(Сред(Хост, Номер, 1))) = 0 Тогда Возврат ""; КонецЕсли;
    КонецЦикла;
    Возврат "https://" + Хост + "/company/personal/user/" + ПользовательId + "/tasks/task/view/" + ЗадачаId + "/";
КонецФункции

Функция ДанныеЗаказа(Заказ, Компьютер = "", ОшибкаСеанса = "", ОбновитьИзСервиса = Истина) Экспорт
    Данные = Новый Структура("Состояние,Ошибка,ЗадачаId,Ссылка,ОперацияId,СозданиеЗаблокировано", "", "", "", "", "", Ложь);
    Если Не ЗначениеЗаполнено(Заказ) Тогда
        Данные.Состояние = "Заказ ещё не записан."; Возврат Данные;
    КонецЕсли;
    Если ОбновитьИзСервиса И Не ПустаяСтрока(Компьютер) Тогда
        // Явное открытие/обновление проверяет и подтверждённую связь.
        // Фоновое оповещение формы читает только локальные данные.
        ОбновитьСостояния(Компьютер, "", Заказ);
    КонецЕсли;
    Связь = РегистрыСведений.Расш1_СвязиЗаказовБ24.СоздатьМенеджерЗаписи();
    Связь.Заказ = Заказ; Связь.Прочитать();
    Операция = РегистрыСведений.Расш1_ОперацииБ24.СоздатьМенеджерЗаписи();
    Операция.Заказ = Заказ; Операция.Прочитать();
    Если Операция.Выбран() Тогда
        Данные.Состояние = ТекстСостояния(Операция.Состояние);
        Данные.Ошибка = ТекстОшибки(Операция.Ошибка);
        Данные.ОперацияId = Операция.ОперацияId;
        Данные.СозданиеЗаблокировано = Операция.Состояние <> "cancelled" Или Не ПустаяСтрока(Операция.Ошибка);
    Иначе
        Данные.Состояние = "Связи и незавершённой операции нет.";
    КонецЕсли;
    Если Связь.Выбран() Тогда
        Данные.ЗадачаId = Связь.ЗадачаId;
        Данные.ОперацияId = Связь.ОперацияId;
        Данные.СозданиеЗаблокировано = Истина;
        Данные.Состояние = "Связь с задачей сохранена в 1С.";
        Попытка
            ПользовательId = "";
            Если Операция.Выбран() Тогда ПользовательId = Операция.ИнициаторId; КонецЕсли;
            Если Не ПоложительныйId(ПользовательId) И Не ПустаяСтрока(Компьютер) Тогда
                Id1С = Строка(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор);
                Профиль = JSONЗначение(Настройка("profile|" + Id1С + "|" + Компьютер).Значение);
                ПользовательId = Профиль.initiatorId;
            КонецЕсли;
            Данные.Ссылка = СсылкаЗадачи(Связь.ЗадачаId, ПользовательId);
            Если ПустаяСтрока(Данные.Ссылка) Тогда ВызватьИсключение "STAGE1_LINK_SETTINGS"; КонецЕсли;
        Исключение
            Данные.Ошибка = Данные.Ошибка + ?(ПустаяСтрока(Данные.Ошибка), "", Символы.ПС) + ТекстОшибки("invalid_settings");
        КонецПопытки;
    КонецЕсли;
    Если Не ПустаяСтрока(ОшибкаСеанса) Тогда
        Данные.Ошибка = Данные.Ошибка + ?(ПустаяСтрока(Данные.Ошибка), "", Символы.ПС) + ТекстОшибки(ОшибкаСеанса);
    КонецЕсли;
    Возврат Данные;
КонецФункции

Функция СтатусЗаказа(Заказ) Экспорт
    Возврат ДанныеЗаказа(Заказ).Состояние;
КонецФункции
